/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
関数定義
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/

/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
Pauseキーでアクティブウインドウの最前面固定を切り替え
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/
~Pause::WinSet, AlwaysOnTop, toggle, A

/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
テンキーのピリオド2連打でカンマ入力
If (A_PriorHotKey == A_ThisHotKey and A_TimeSincePriorHotkey < 200)
→前回と今回のホットキーが同じ かつ 前回のホットキーの入力から200ミリ秒以内
この設定を行うと、テンキーのピリオドを押し続けても'.,'が入力された時点で入力が止まる
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/
~NumpadDot::
  If (A_PriorHotKey == A_ThisHotKey and A_TimeSincePriorHotkey < 200)
  {
    SendInput, {BackSpace 2}
    Send,{U+002c}
  }
  Return

/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
選択した文字列を'('等で囲む
文字列を選択してから`無変換+s`を押し、続けて入力した文字で文字列を囲む
「{,",`,#,%」はエスケープ(`)しないと望み通りの動作にならない
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/
^,::
  backup = ClipboardAll
  Clipboard =
  Send, ^x
  ClipWait, 1
  if ErrorLevel = 0
  {
    Input, inputText, I L1 T1,{Esc}, (,[,`{,',",``,`%,-,_,`#
    ;MsgBox, %Clipboard%
    If ErrorLevel = Match
    {
      If inputText = [
      {
        Send,{[}
        Send, ^v
        Send,{]}
        Sleep 200
      } 
      Else if inputText = (
      {
        Send,{(}
        Send, ^v
        Send,{)}
        Sleep 200
      }
      Else if inputText = {
      {
        Send,{{}
        Send, ^v
        Send,{}}
        Sleep 200
      }
      Else
      {
        Send,{%inputText%}
        Send, ^v
        Send,{%inputText%}
        Sleep 200
      }
    }
  }
  Clipboard = %backup%
  Return

/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
Ctrl-Alt-カーソルキーで矢印を入力
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/
^!Left::Send,{U+2190}
^!Up::Send,{U+2191}
^!Right::Send,{U+2192}
^!Down::Send,{U+2193}

/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
Alt-Qの2連打でアプリを閉じる
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/
~!q::
  Input, inputText, I L1 T0.5, !q
  IfInString, ErrorLevel, EndKey:
  {
    Send, !{F4}
  }
  Return

/*
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
Ctrl-Alt-Rでこのスクリプトを再読み込みする
https://autohotkey.com/docs/commands/Reload.htm 参照
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
*/
^!r::Reload